[
  "Jos sprintti alkaa tuntua maratonilta, vika ei oo juoksijassa vaan kartassa.",
  "Deadline ei ole päivä vaan tunne – se kun lopetat säätämisen ja päätät julkaista.",
  "Jos kaikki on tärkeää, mikään ei ole – priorisoi tai pala poroksi.",
  "Design-dokkari on kartta, ei laki – mutta ilman karttaa eksyt joka kerta samaan suohon.",
  "Älä pelkää leikkaamista – hyvä peli syntyy siitä, mitä jätät pois.",
  "Pelaaja ei koskaan koe peliäsi niin kuin sinä – ja se on ihan oikein.",
  "Jos joku feature vaatii kolme kalvoa selitystä, se ei kuulu peliin.",
  "Pelimoottori ei ole ongelma – paitsi silloin kun siitä tulee projekti.",
  "Kaikki bugit ei oo bugeja – osa on pelin sielua, tai pelaajan juttuja.",
  "Laita ittes peliin, mutta älä niin syvälle ettet pääse sieltä pois.",
  "Mitä nopeammin hyväksyt että scope elää, sitä vähemmän sä kuolet.",
  "Tiimi ei kaadu virheeseen, mutta se kaatuu hiljaisuuteen sen jälkeen.",
  "Ei kannata kuitenkaan innostua liikaa – tämä menee vielä uusiksi.",
  "Jos se näyttää toimivan, joku ei ole testannut kunnolla.",
  "Ihan turhaa yrittää optimoida ennen kuin joku edes pelaa tätä.",
  "Deadline on enemmän tunne kuin totuus.",
  "Jos joku sanoo 'helppo korjaus', se ei ole.",
  "Kyllä se build hajoaa just kun lähdet kotiin.",
  "Parempi ratkaista huomenna kuin rikkoa tänään.",
  "Älä koske siihen, jos se ei ole vielä räjähtänyt.",
  "Jos roadmapissa lukee Q1, se tarkoittaa ehkä ensi syksyä.",
  "Bugilistat eivät lyhene, ne vain vaihtavat muotoa.",
  "Ei se ole huono idea, se on vain aikataulun ulkopuolella.",
  "Aina kun koodi toimii heti, tulee vähän huolestunut olo.",
  "Jos pitää valita siisti ja toimiva, ota jälkimmäinen.",
  "Kaikki ideat ovat hyviä, kunnes joku yrittää toteuttaa ne.",
  "Kun joku sanoo 'tehdään MVP', se tarkoittaa 12 ominaisuutta.",
  "Jos peli kaatuu vain joskus, se kaatuu aina julkaisussa.",
  "Tämä oli varmaan hyvä päätös joskus, en vain muista milloin.",
  "Jos ei muista miksi se koodi on siellä, älä poista sitä.",
  "Ei se ole tekninen velka, se on perinne.",
  "Jos joku sanoo 'nopeasti testattu', ei ole.",
  "Onko tämä bugi vai featuuri? En enää tiedä.",
  "Jos kukaan ei ymmärrä designia, se päätyy tuotantoon.",
  "Yksinkertainen peli on se, jonka tekeminen vei kaksi vuotta.",
  "Jos kaikki näyttää hyvältä, joku unohti jotain.",
  "Jos käyttäjä ei löydä sitä, se on käyttöliittymän syy.",
  "En minä ole kyyninen – olen realisti, jolla on selkä kipeä.",
  "Jos testaus alkaa maanantaina, se tarkoittaa perjantaina illalla.",
  "Miksi tehdä kunnolla, kun voi kiireessä tehdä kolme kertaa?",
  "Jos tätä ei ole dokumentoitu, se ei ole tärkeä osa peliä.",
  "Kun joku sanoo 'ei varmaan vie kauaa', alkaa viikonloppu.",
  "Tiimityö on sitä että kaikki kärsii yhtä aikaa.",
  "Jos kaikki toimi, testaa lisää. Se ei voi olla totta.",
  "Joku kysyi miksi tämä on näin. En tiedä. Älä koske siihen.",
  "Jos joku sanoo 'feature complete', hän valehtelee.",
  "Jos tämä oli hyvä idea krapulassa, se ei ole hyvä idea enää.",
  "Jos käyttäjät eivät valita, ne eivät ole löytäneet vielä sitä.",
  "Jos joku ehdottaa uudelleenjulkaisua, juokse karkuun.",
  "Jos manageri sanoo 'mulla olis yks nopea juttu' – poistu.",
  "Jos joku kysyy 'onko tämä nyt done', vastaa vastakysymyksellä.",
  "Tämä olisi helpompaa, jos emme tekisi peliä.",
  "Ei kannata kuitenkaan refaktoroida, jos deadline on tunnin päästä.",
  "Jos roadmap näyttää realistiselta, se on väärä roadmap.",
  "Jos koodi on mystinen, kirjoittaja on lomalla.",
  "Kaikki vaikuttaa mahdottomalta, kunnes joku tekee kiireessä sen huonosti.",
  "Älä koskaan luota siihen että joku toinen hoitaa sen.",
  "Jos käyttöliittymä toimii, se näyttää varmasti rumalta.",
  "Ennen kaikki oli bugisempaa. Tai sitten ei.",
  "Jos muistat miten tämä toimii, olet liian kauan tässä projektissa.",
  "Jos tämä olisi tärkeää, siitä olisi joku Jira-tiketti.",
  "Jos ei enää jaksa välittää, syntyy peli.",
  "Ei tätä varten koodattu, mutta ei jakseta muuttaa enää.",
  "Jos kukaan ei tiedä miksi se toimii, älä selitä.",
  "Jos tämä menee läpi QA:sta, ei ollut tarpeeksi testejä.",
  "Jos joku sanoo 'ei kiirettä', se on jo myöhässä.",
  "Jos tämä on vitsi, se päätyy release candidateen.",
  "Jos joku ehdottaa hackathonia, se tarkoittaa iltatyötä.",
  "Tämä kuulostaa suunnitelmalta – mikä meni pieleen?",
  "Ei sillä ole väliä kuka teki tämän, se on meidän nyt.",
  "Tiedät että peli on valmis, kun ketään ei enää kiinnosta.",
  "Jos commit-viesti on tyhjä, siellä tapahtui suuria asioita.",
  "Jos build onnistuu kerralla, epäile kaikkea.",
  "Ei tässä nyt ehditä tehdä kunnolla, tehdään vaan.",
  "Jos joku kysyy 'onko aikaa yhdelle ominaisuudelle' – ei ole.",
  "Jos tämä näyttää hyvältä, se ei ole vielä valmis.",
  "Jos joku testaa oikeasti, peli ei läpäise sitä.",
  "Jos kaikki toimii localilla, ei toimi tuotannossa.",
  "Tämä idea vaatii aikaa, mitä ei ole.",
  "Jos tämän lukee kahden vuoden päästä, pyytää anteeksi.",
  "Jos kaikki epäonnistuu, kokeillaan vanhaa branchia.",
  "Jos tämä pitää selittää johdolle, ei selitetä.",
  "Jos peli ei ole hauska, lisätään partikkeliefektejä.",
  "Jos tiimi nauraa, se ei ole hyvä merkki.",
  "Jos koodi haisee, se on elossa.",
  "Jos tämä toimii, älä hengitä siihen suuntaan.",
  "Jos käyttäjä ei eksy, se on vahinko.",
  "Jos peli toimii vain yhdessä puhelimessa, julkaistaan se ensin.",
  "Jos tämä toimii vain iltapäivisin – se on 'known issue'.",
  "Jos projektin nimi muuttuu kolmesti, se on menossa julki.",
  "Jos peli ei crashaa heti, hyvä alku.",
  "Jos joku sanoo 'beta build', se tarkoittaa 'jotain toimii'.",
  "Jos kukaan ei kysy mitään, ne ei testaa sitä vielä.",
  "Jos kaikki näyttää valmiilta, demo perutaan.",
  "Jos feature toimii, sitä ei dokumentoida koskaan.",
  "Jos tämä tuntuu turhalta, se on tärkeää.",
  "Jos koodi näyttää epäilyttävältä, se on omaa.",
  "Jos tämä fixaa bugin, se rikkoo kolme muuta.",
  "Jos et ole varma miksi, älä tee sitä.",
  "Jos joku sanoo 'ai tää on vielä käytössä?', se ei ole hyvä juttu.",
  "Jos se toimii, se on 'feature'. Jos ei, se on 'legacy'.",
  "Jos jonkun pitää muistaa tämä, kukaan ei muista.",
  "Jos tämä menee jakeluun näin, älä sano kenellekään.",
  "Jos joku kysyy 'eikö tätä voinut automatisoida?', kyllä.",
  "Jos tämä ei ole kriittinen, se muuttuu sellaiseksi yöllä.",
  "Jos olet vielä hereillä, ota kahvia tai lopeta.",
  "Jos tämä tehdään nyt, sitä ei tehdä enää ikinä kunnolla.",
  "Jos tämä toimii tänään, älä testaa huomenna.",
  "Jos tarvitset tämän viisauden, olet jo liian pitkällä.",
  "Jos käyttäjä kysyy ‘mitä mä teen tässä’, et oo tehnyt työtäsi.",
  "Demo on lupaus – älä lupaa liikaa, älä koskaan liian vähän.",
  "Koodari ilman testaajaa on kuin kenttäsuunnittelija ilman pelaajaa – sokea ja yksinäinen.",
  "Hyvä peli tuntuu paremmalta kuin näyttää, ja parempi peli tuntuu omalta.",
  "Jos feature ei mahdu yhteen post-it-lappuun, se ei mahdu buildiin.",
  "Tyhjät ruudut pelissä on designin hiljaisuutta – kuuntele niitä.",
  "Jos peli ei ole hauska testissä, se ei ole hauska julkaisussa.",
  "Jos kaikki feedback tuntuu väärältä, vika on todennäköisesti sinussa.",
  "Motivaatio ei pala loppuun siksi ettei oo intoa, vaan siksi ettei oo suuntaa.",
  "Early access ei tarkoita keskeneräisyyden oikeutusta, vaan luottamuksen koetta.",
  "Jos taide ei sovi käyttöön, se ei ole käyttötaidetta – vaan portfolioa.",
  "Yks bugi voi tappaa fiiliksen, kymmenen bugia tekee siitä vitsin.",
  "Buildi on buildi vasta kun sillä uskaltaa nolata itsensä kavereille.",
  "Jos deadline painaa mutta kahvi ei enää auta, tee jotain helppoa valmiiksi – se auttaa enemmän.",
  "Älä tee peliä johon sinulla ei ole mitään sanottavaa.",
  "Kaikki mitä voi mennä pieleen menee pieleen – paitsi jos se on softassa, silloin se vaan jää sinne.",
  "Jos manageri puhuu enemmän kuin tiimi, peli valmistuu PowerPointissa.",
  "Versiohallinta ei ole vaihtoehto – se on hengityskone.",
  "Hyvä pelikokemus ei synny fiiliksestä, vaan rakenteesta joka tuottaa fiiliksen.",
  "Älä pelkää tehdä tyhmää – pelkää ettet tee mitään.",
  "Jos et testaa, testaa pelaaja. Ja arvaa kenestä se kirjoittaa Redditiin.",
  "Kukaan ei kiitä siitä että se toimii – mutta kaikki muistaa sen kerran kun se ei.",
  "Ylityö ei ole ratkaisu – se on lasku, joka tulee myöhemmin korkojen kanssa.",
  "Design ei ole se mitä keksit, vaan se mitä jätät pois.",
  "Pahin tekninen velka on henkinen – se tunne ettei uskalla koskea mihinkään.",
  "Jos jokin vie aikaa viikosta toiseen, se ei ole edge case – se on systeemi.",
  "Älä taistele toolien kanssa – rakenna ne uusiksi tai vaihda ne ajoissa.",
  "Tyyli ei pelasta, jos sisältö ontuu. Mutta hyvä sisältö pelastaa rumankin pelin.",
  "Yksi hyvä idea kestää useamman projektin – jos maltat antaa sen kasvaa.",
  "Huonot dokumentit tekee tyhmästä ideasta mahdottoman – hyvät voi tehdä siitä ainakin yritettävän.",
  "Jos peli ei opeta pelaajaa pelaamaan, se opettaa pelaajan sulkemaan sen.",
  "Älä rakenna peliä, jota et itse jaksaisi pelata viikonloppuna.",
  "Jos yksikään tiimiläinen ei tiedä mitä tehdään seuraavaksi, kukaan ei tee mitään.",
  "Jos tiimipalaverissa kukaan ei naura, olette joko liian väsyneitä tai liian kaukana toisistanne.",
  "Mitä enemmän puskuroit kaikkea, sitä vähemmän syntyy oikeita hetkiä.",
  "Jos tunnet että mikään ei valmistu, pilko pienemmäksi – ja julkaise jotain heti.",
  "Älä mittaa pelin laatua sisällön määrällä – mittaa sillä, kuinka paljon sitä pelaa toisen kerran.",
  "Toinen peli on helpompi kuin ensimmäinen – mutta todennäköisesti isompi moka.",
  "Kaikki haluaa tehdä uutta – kukaan ei halua ylläpitää vanhaa. Tee siitä oma tiimi.",
  "Jos kaikki haluaa olla creative director, peli jää tekemättä.",
  "Kun pelaaja sanoo ettei ymmärrä, älä selitä – korjaa.",
  "Älä tee kaikille kaikkea – tee jollekin jotain tärkeää.",
  "Hyvä peli ei tarvitse julkaisua – se löytää yleisönsä muutenkin. Mutta julkaisu ei koskaan pelasta huonoa peliä.",
  "Älä tee mockupia joka näyttää paremmalta kuin build – silloin kukaan ei halua nähdä buildia.",
  "Kun yksi bugi ärsyttää, se on todennäköisesti UI.",
  "Jos buildissa ei ole mitään mistä olla ylpeä, et ole valmis julkaisemaan.",
  "Jos pelaaja ei löydä nappia, se ei ole pelaajan vika.",
  "Yksi karismaattinen testipelaaja on vaarallisempi kuin kymmenen hiljaista virallista raporttia.",
  "Jos pelaaja sanoo 'ihan kiva', se on huono. Jos sanoo 'en mä tiiä miksi mutta tää jäi mieleen' – se on hyvä.",
  "Keskeneräinen hyvä peli on parempi kuin valmis mitäänsanomaton.",
  "Älä käytä kahta viikkoa ominaisuuteen jota kukaan ei ehdi edes huomata.",
  "Hyvä efekti ei korvaa huonoa tunnetta – mutta hyvä tunne voi korvata puuttuvan efektin.",
  "Lopeta kun toimii – älä kun kyllästyt säätämään.",
  "Jos design tuntuu väkisin väännetyltä, palaa pelaajan alkuoletukseen.",
  "Pelaaja ei halua ymmärtää peliäsi – se haluaa tuntea sen.",
  "Viimeistely ei ole työvaihe, se on moraalinen velvollisuus.",
  "Jos et ole varma onko tämä hauskaa – se ei ole.",
  "Älä tee tarinaa, jos et tiedä miksi se on osa peliä.",
  "Jos pelissä ei ole päätöksiä, siinä ei ole myöskään peliä.",
  "Kun kaikki on kunnossa, pelaaja ei huomaa mitään – se tarkoittaa että teit kaiken oikein.",
  "Hyvä idea ilman toteutusta on kalvo – hyvä toteutus ilman ideaa on demo.",
  "Pelit ei ole koodia tai grafiikkaa – ne on aikomuksia jotka toteutetaan interaktiolla.",
  "Tiimi ei tarvitse sankaria – se tarvitsee ihmisiä jotka saa toiset loistamaan.",
  "Jos mietit, pitääkö tämä tehdä kunnolla, vastaus on kyllä.",
  "Kaikki pelit on joskus rumia – mutta hyvät pelit uskaltaa näyttää ne ajoissa.",
  "Jos et osaa sanoa miksi tämä on tässä, se ei kuulu peliin.",
  "Kukaan ei kiitä siitä että pääsit ajoissa – mutta kaikki muistaa jos myöhästyit.",
  "Buildin rikkominen ei ole synti – siitä vaikeneminen on.",
  "Jos et tiedä mitä tehdä, tee jotain mikä toimii – ja korvaa se paremmalla myöhemmin.",
  "Älä julkaise peliäsi jos et tiedä keitä varten se on.",
  "Tiimissä pitää olla yksi tyyppi joka ei koskaan hyväksy puolivillaista.",
  "Jos feedbacki tuntuu pahalta, se on luultavasti totta.",
  "Kaikki projektit loppuu – kysymys on vaan, milloin ja kuinka kovaa.",
  "Yksi idea päivässä pitää pivotit loitolla.",
  "Jos ominaisuus ei toimi paperilla, se ei toimi pelissäkään.",
  "Huono kommunikaatio tappaa hyvät pelit nopeammin kuin bugit.",
  "Peli ilman reaktiota ei ole interaktiivinen – se on kuollut.",
  "Jos et usko siihen mitä teet, älä julkaise sitä maailmalle.",
  "Peleissä tärkeintä ei ole se, mitä ne tekee – vaan mitä ne herättää.",
  "Älä tee peliä jota et kehtaisi näyttää lapsellesi – tai äidillesi.",
  "Hyvä pelisuunnittelu on empatian laji – ei dominointia.",
  "Kun pelaaja kysyy 'voinko tehdä tämän?', ja vastaus on kyllä – olet oikealla tiellä.",
  "Jos jokin tuntuu tylsältä tehdä, se on todennäköisesti tylsää myös pelata.",
  "Älä rakenna mekaniikkaa joka ei kehity – tai se tappaa mielenkiinnon.",
  "Jos pelaaja pitää ohjainta väärinpäin, peli on todennäköisesti liian monimutkainen.",
  "Jos peli ei kerro pelaajalle mitä se on, netti kertoo sen kyllä – ja kovaa.",
  "Kaikki pelit ovat keskeneräisiä – julkaise paras versio, ei valmis versio.",
  "Koodin pitää palvella peliä – ei päinvastoin.",
  "Jos flow katoaa, ota tauko – tai tee jotain naurettavaa. Se usein auttaa.",
  "Jos et tiedä miksi tämä tuntuu hyvältä, älä silti riko sitä ennen kuin tiedät.",
  "Pelin ei tarvitse olla täydellinen – mutta sen täytyy olla tärkeä edes jollekin.",
  "Jos tutoriaali ei toimi, vika on yleensä siinä että pelaaja on jo eksynyt.",
  "Älä koskaan aliarvioi UI:ta, vaikka se tuntuu valmiilta.",
  "Hyvä peli kestää säädön, mutta ei kestä sekasotkua.",
  "Motivaation puute ei ole bugi – se on huonon sprintin jäljiltä.",
  "Tiimi, jossa kaikki myöntää virheensä ilman kysymyksiä, on matkalla kohti julkaisua.",
  "Jos buildissa on placeholdereita, kysy kuka sen hyväksyi. Sitten kysy miksi.",
  "Deadline ei ole design-ratkaisu, se on tekosyy kun ei jaksettu tehdä kunnolla.",
  "Kun pelaaja sanoo 'tämähän oli yllättävän hyvä', olet onnistunut enemmän kuin arvaat.",
  "Pahinta ei ole feature creep, vaan kun sitä kutsutaan laajentamiseksi.",
  "Pelin tekeminen ilman dokumentaatiota on kuin kokkaisi ilman reseptiä.",
  "Jos koodi ei pelota edes vähän, se ei ole vielä valmis.",
  "Hyvä projektipäällikkö ei kysy 'missä mennään?', vaan 'missä jumittaa?'.",
  "Jos keskustelu alkaa 'entä jos käyttäjä tekee näin...', olet jo myöhässä.",
  "Kaikki mikä näyttää valmiilta, on todennäköisesti pelkkä mockup.",
  "Jos kukaan ei vihaa sun peli-ideaa, se ei ole vielä riittävän kiinnostava.",
  "Jos roadmap on yksi rivi, saat siitä burnoutin ja kalenterimerkinnän.",
  "Älä tee pelistäsi selitettävää – tee siitä pelattava.",
  "Hyvä pelimekaniikka selittää itsensä yhdellä painalluksella.",
  "Jos UI näyttää kauniilta mutta kukaan ei ymmärrä sitä, se on taideprojekti.",
  "Huonot päätökset eivät katoa refaktoroinnilla – ne pitää hyväksyä.",
  "Koodikommentti ei ole anteeksipyyntö, mutta joskus se on hyvä alku.",
  "Päivitä buildi ennen kuin esität – tai varaudu punastumaan.",
  "Tiimi ei tarvitse sankaria – se tarvitsee debuggaavan realistin.",
  "Jos kukaan ei kysy mitään testisessiossa, peli joko toimii tai on täysin epäselvä.",
  "Kaikki featuret näyttävät tarpeellisilta PowerPointissa.",
  "Jos joku sanoo 'tämä oli nopea tehdä', kysy missä dokumentaatio on.",
  "Älä tee pelistäsi monimutkaista, jos et aio opettaa sitä kenellekään.",
  "Bugilistalla ei ole ikää – vain syntymäpäiviä, joita kukaan ei juhli.",
  "Jos joku sanoo 'toimii koneellani', käynnistä palaveri.",
  "Peli on valmis silloin kun et enää keksi tekosyitä lykätä julkaisua.",
  "Jos sprintin alussa kaikki hymyilee, scopea ei vielä ymmärretty.",
  "Jos pelaaja ei tunne mitään, olet tehnyt mekaanisen testin – et peliä.",
  "Älä korjaa bugia, jonka käyttäjä luulee ominaisuudeksi – ainakaan heti.",
  "Kun haluat lisätä vielä yhden ominaisuuden, lisää sen sijaan kahvi.",
  "Jos peli pyörii täydellisesti devaajan koneella, julkaise se sille koneelle.",
  "Yksi hyvä looppi on parempi kuin kymmenen keskinkertaista leveliä.",
  "Älä tee pelistäsi selitettävää – tee siitä tunnettavaa.",
  "Jos animaatio näyttää oudolta, syyllinen on yleensä rytmi.",
  "Kukaan ei kiitä siitä että kaikki toimii – mutta kaikki muistaa sen kun ei toiminut.",
  "Jos suunnitelma on epäselvä, toteutus ei pelasta sitä.",
  "Hyvä design ei ole näkyvää – se on näkymätöntä mukavuutta.",
  "Jos joku sanoo 'ei kai tähän tarvi testejä', älä anna sen koskea tuotantoon.",
  "Jos idea vaatii 5 minuuttia selittämistä, se vaatii 1 minuutin leikkaamista.",
  "Jos kukaan ei kysy kuka omistaa featuret, kaikki luulee että joku muu hoitaa.",
  "Älä anna julkaisupäivän olla se hetki kun testaat ekakertaa lokalisoinnin.",
  "Jos joku käyttää sanaa 'innovatiivinen' kolme kertaa, tiedät että se ei ole.",
  "Jos suunnitteludokumentti on pidempi kuin buildin runtime, pysähdy.",
  "Yksi nauru pelitestissä on arvokkaampi kuin kymmenen käyttäjäkyselyä.",
  "Pelaaja ei välitä miksi – se välittää mitä ja miten.",
  "Jos UI tuntuu raskaalta, se on. Jos se ei tunnu miltään, sekin on ongelma.",
  "Peli ei ole valmis kun se ei kaadu – se on valmis kun pelaaja ei halua lopettaa.",
  "Jos peli alkaa vaikuttaa työltä, niin se myös tuntuu siltä.",
  "Feature joka ei ole kenenkään vastuulla, on kaikkien ongelma.",
  "Julkaisu ei korjaa mitään mitä et korjannut edellisessä sprintissä.",
  "Jos haluat innostua omasta pelistäsi, pelaa sitä ilman nettiä.",
  "Älä tee painikkeita joilla ei ole tunnetta – se on kuin lämmin vesi: ei kukaan halua.",
  "Jos pelin tärkein fiilis katoaa versionvaihdossa, vika on suunnassa.",
  "Hyvä tiimi tekee tylsästä tehtävästä pelastettavan – huono tiimi tekee siitä palon.",
  "Jos idea toimii paperilla, se voi toimia pelissä. Jos ei, ei varmasti.",
  "Älä rakenna arkkitehtuuria tulevaisuudelle, jos et saa nykyhetkeä toimimaan.",
  "Jos se kuulostaa hyvältä palaverissa mutta ei toimi buildissa, se oli myyntipuhe.",
  "Ylpeys on huono debuggeri.",
  "Jos käyttäjällä menee yli 5 sekuntia löytää nappi, nappi ei ole siellä.",
  "Feature joka ei tee pelistä hauskempaa, tekee siitä pidemmän.",
  "Hyvä peli ei kerro pelaajalle mitä tehdä – se saa pelaajan haluamaan tehdä sen.",
  "Pelimoottori ei ole pyhä – se on työkalu. Jos se ei toimi, vaihda vasaraa.",
  "Jos jokin toimii mutta kukaan ei tiedä miksi, kirjoita se ylös heti.",
  "Jos kaikki toimii mutta mikään ei tunnu hyvältä, olet tehnyt käyttöliittymän – et peliä.",
  "Pelaajan luottamus ei synny grafiikasta – se syntyy logiikasta.",
  "Kaikki mitä voi optimoida ennen kuin toimii, on ennenaikaista pelastamista.",
  "Jos valikot on seikkailu, peli ei koskaan ala.",
  "Tiimi joka uskaltaa sanoa 'tämä on huono' pelastaa projektin – vaikka vähän sattuu.",
  "Jos deadline lähestyy ja fiilis on rauhallinen, jotain on unohtunut.",
  "Peli ei ole valmis, jos testauslista on vain nimilista.",
  "Kun pelaaja eksyy ja nauttii siitä, olet rakentanut maailman.",
  "Hyvä pelin alku antaa syyn jäädä – hyvä loppu antaa syyn palata.",
  "Jos säädät kolmatta päivää jotain mitä ei edes huomata, se ei kuulu peliin.",
  "Jos jokin osa pelistä on vaikea tehdä, mutta helppo pelata – jatka.",
  "Älä mittaa pelin pituutta tunneissa vaan hetkissä.",
  "Pelisuunnittelu on kuin keittäisi soppaa pelaajan muistista.",
  "Jos joku kysyy miksi tämä on näin, eikä kukaan tiedä – leikataan.",
  "Älä yritä ratkaista tylsää osiota tekemällä siitä monimutkaisempi.",
  "Hyvä peli tuntuu paremmalta kuin mitä se näyttää trailereissa.",
  "Jos pelaaja jää miettimään mitä tapahtui, se on parempi kuin että se ei mieti mitään.",
  "Feature jota ei voi selittää yhdellä lauseella ei kuulu demoon.",
  "Jos pelissä ei ole taukoa, pelaaja pitää sen itse – pysy rytmissä.",
  "Peli joka ei opi pelaajalta mitään, ei kasva.",
  "Älä rakastu workaroundiin – se ei rakasta sua takaisin.",
  "Jos deadline stressaa enemmän kuin julkaisu, projektissa on väärä prioriteetti.",
  "Jos pelaaja kysyy 'voinko tehdä tämän?', ja peli sanoo kyllä – sä voit jo hymyillä.",
  "Kukaan ei muista vanhaa bugia, jos peli on nykyään nautittava.",
  "Jos peliäsi voi pelata yhdellä kädellä – mieti kuka pelaa toisella kädellä.",
  "Hyvä peli antaa valintoja – ei sekasortoa.",
  "Jos soundit jäävät soimaan päähän – se on feature, ei bugi.",
  "Tiimi ilman palautetta on tiimi ilman suuntaa.",
  "Jos jokin toimii vain ohjeiden lukemisen jälkeen, se ei toimi.",
  "Älä tee pelistäsi järkevää – tee siitä looginen pelaajalle.",
  "Kaikki haluaa polishia, kukaan ei halua aikaa siihen – tee sitä silti.",
  "Jos pelaaja unohtaa kontrollit mutta jatkaa pelaamista, olet onnistunut.",
]
