[
  "Ei kannata kuitenkaan innostua liikaa – tämä menee vielä uusiksi.",
  "Jos se näyttää toimivan, joku ei ole testannut kunnolla.",
  "Ihan turhaa yrittää optimoida ennen kuin joku edes pelaa tätä.",
  "Deadline on enemmän tunne kuin totuus.",
  "Jos joku sanoo 'helppo korjaus', se ei ole.",
  "Kyllä se build hajoaa just kun lähdet kotiin.",
  "Parempi ratkaista huomenna kuin rikkoa tänään.",
  "Älä koske siihen, jos se ei ole vielä räjähtänyt.",
  "Jos roadmapissa lukee Q1, se tarkoittaa ehkä ensi syksyä.",
  "Bugilistat eivät lyhene, ne vain vaihtavat muotoa.",
  "Ei se ole huono idea, se on vain aikataulun ulkopuolella.",
  "Aina kun koodi toimii heti, tulee vähän huolestunut olo.",
  "Jos pitää valita siisti ja toimiva, ota jälkimmäinen.",
  "Kaikki ideat ovat hyviä, kunnes joku yrittää toteuttaa ne.",
  "Kun joku sanoo 'tehdään MVP', se tarkoittaa 12 ominaisuutta.",
  "Jos peli kaatuu vain joskus, se kaatuu aina julkaisussa.",
  "Tämä oli varmaan hyvä päätös joskus, en vain muista milloin.",
  "Jos ei muista miksi se koodi on siellä, älä poista sitä.",
  "Ei se ole tekninen velka, se on perinne.",
  "Jos joku sanoo 'nopeasti testattu', ei ole.",
  "Onko tämä bugi vai featuuri? En enää tiedä.",
  "Jos kukaan ei ymmärrä designia, se päätyy tuotantoon.",
  "Yksinkertainen peli on se, jonka tekeminen vei kaksi vuotta.",
  "Jos kaikki näyttää hyvältä, joku unohti jotain.",
  "Jos käyttäjä ei löydä sitä, se on käyttöliittymän syy.",
  "En minä ole kyyninen – olen realisti, jolla on selkä kipeä.",
  "Jos testaus alkaa maanantaina, se tarkoittaa perjantaina illalla.",
  "Miksi tehdä kunnolla, kun voi kiireessä tehdä kolme kertaa?",
  "Jos tätä ei ole dokumentoitu, se ei ole tärkeä osa peliä.",
  "Kun joku sanoo 'ei varmaan vie kauaa', alkaa viikonloppu.",
  "Tiimityö on sitä että kaikki kärsii yhtä aikaa.",
  "Jos kaikki toimi, testaa lisää. Se ei voi olla totta.",
  "Joku kysyi miksi tämä on näin. En tiedä. Älä koske siihen.",
  "Jos joku sanoo 'feature complete', hän valehtelee.",
  "Jos tämä oli hyvä idea krapulassa, se ei ole hyvä idea enää.",
  "Jos käyttäjät eivät valita, ne eivät ole löytäneet vielä sitä.",
  "Jos joku ehdottaa uudelleenjulkaisua, juokse karkuun.",
  "Jos manageri sanoo 'mulla olis yks nopea juttu' – poistu.",
  "Jos joku kysyy 'onko tämä nyt done', vastaa vastakysymyksellä.",
  "Tämä olisi helpompaa, jos emme tekisi peliä.",
  "Ei kannata kuitenkaan refaktoroida, jos deadline on tunnin päästä.",
  "Jos roadmap näyttää realistiselta, se on väärä roadmap.",
  "Jos koodi on mystinen, kirjoittaja on lomalla.",
  "Kaikki vaikuttaa mahdottomalta, kunnes joku tekee kiireessä sen huonosti.",
  "Älä koskaan luota siihen että joku toinen hoitaa sen.",
  "Jos käyttöliittymä toimii, se näyttää varmasti rumalta.",
  "Ennen kaikki oli bugisempaa. Tai sitten ei.",
  "Jos muistat miten tämä toimii, olet liian kauan tässä projektissa.",
  "Jos tämä olisi tärkeää, siitä olisi joku Jira-tiketti.",
  "Jos ei enää jaksa välittää, syntyy peli.",
  "Ei tätä varten koodattu, mutta ei jakseta muuttaa enää.",
  "Jos kukaan ei tiedä miksi se toimii, älä selitä.",
  "Jos tämä menee läpi QA:sta, ei ollut tarpeeksi testejä.",
  "Jos joku sanoo 'ei kiirettä', se on jo myöhässä.",
  "Jos tämä on vitsi, se päätyy release candidateen.",
  "Jos joku ehdottaa hackathonia, se tarkoittaa iltatyötä.",
  "Tämä kuulostaa suunnitelmalta – mikä meni pieleen?",
  "Ei sillä ole väliä kuka teki tämän, se on meidän nyt.",
  "Tiedät että peli on valmis, kun ketään ei enää kiinnosta.",
  "Jos commit-viesti on tyhjä, siellä tapahtui suuria asioita.",
  "Jos build onnistuu kerralla, epäile kaikkea.",
  "Ei tässä nyt ehditä tehdä kunnolla, tehdään vaan.",
  "Jos joku kysyy 'onko aikaa yhdelle ominaisuudelle' – ei ole.",
  "Jos tämä näyttää hyvältä, se ei ole vielä valmis.",
  "Jos joku testaa oikeasti, peli ei läpäise sitä.",
  "Jos kaikki toimii localilla, ei toimi tuotannossa.",
  "Tämä idea vaatii aikaa, mitä ei ole.",
  "Jos tämän lukee kahden vuoden päästä, pyytää anteeksi.",
  "Jos kaikki epäonnistuu, kokeillaan vanhaa branchia.",
  "Jos tämä pitää selittää johdolle, ei selitetä.",
  "Jos peli ei ole hauska, lisätään partikkeliefektejä.",
  "Jos tiimi nauraa, se ei ole hyvä merkki.",
  "Jos koodi haisee, se on elossa.",
  "Jos tämä toimii, älä hengitä siihen suuntaan.",
  "Jos käyttäjä ei eksy, se on vahinko.",
  "Jos peli toimii vain yhdessä puhelimessa, julkaistaan se ensin.",
  "Jos tämä toimii vain iltapäivisin – se on 'known issue'.",
  "Jos projektin nimi muuttuu kolmesti, se on menossa julki.",
  "Jos peli ei crashaa heti, hyvä alku.",
  "Jos joku sanoo 'beta build', se tarkoittaa 'jotain toimii'.",
  "Jos kukaan ei kysy mitään, ne ei testaa sitä vielä.",
  "Jos kaikki näyttää valmiilta, demo perutaan.",
  "Jos feature toimii, sitä ei dokumentoida koskaan.",
  "Jos tämä tuntuu turhalta, se on tärkeää.",
  "Jos koodi näyttää epäilyttävältä, se on omaa.",
  "Jos tämä fixaa bugin, se rikkoo kolme muuta.",
  "Jos et ole varma miksi, älä tee sitä.",
  "Jos joku sanoo 'ai tää on vielä käytössä?', se ei ole hyvä juttu.",
  "Jos se toimii, se on 'feature'. Jos ei, se on 'legacy'.",
  "Jos jonkun pitää muistaa tämä, kukaan ei muista.",
  "Jos tämä menee jakeluun näin, älä sano kenellekään.",
  "Jos joku kysyy 'eikö tätä voinut automatisoida?', kyllä.",
  "Jos tämä ei ole kriittinen, se muuttuu sellaiseksi yöllä.",
  "Jos olet vielä hereillä, ota kahvia tai lopeta.",
  "Jos tämä tehdään nyt, sitä ei tehdä enää ikinä kunnolla.",
  "Jos tämä toimii tänään, älä testaa huomenna.",
  "Jos tarvitset tämän viisauden, olet jo liian pitkällä.",
  "Jos käyttäjä kysyy ‘mitä mä teen tässä’, et oo tehnyt työtäsi."
]
